// pages/leaseContract/leaseContract.js
const WxParse = require('../../wxParse/wxParse.js')
import {
  contractContent
} from '../../utils/request'
Page({

  /**
   * 页面的初始数据
   */
  data: {

  },
  getContractContent() {
    contractContent({}, resd => {
      if (resd && resd.code == 10000) {
        WxParse.wxParse('newsDetail.contentHtml', 'html', resd.data.content, this, 5)
      }
    })
  },
  goBack: function () {
    wx.navigateBack({
      delta: 1,
    });
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    // WxParse.wxParse('newsDetail.contentHtml', 'html', '一、租赁标的甲方将位于[具体地址]的手机屏幕店铺及店内相关设备出租给乙方使用，具体包括：店铺面积：[X]平方米；店内设备：[详细列出设备名称、数量、型号，如手机屏幕检测仪器3台、贴膜工具套装5套等]；附属设施：[如空调、货架、收银系统等]。二、租赁期限租赁期限自______年____月____日起至______年____月____日止，共计______个月。租赁期满前30日，乙方如需续租，应书面通知甲方，双方协商一致后可续签合同；未通知或协商不一致的，本合同到期自动终止。三、租金及支付方式租金标准：每月租金人民币[X]元（大写：____________________）。一、租赁标的甲方将位于[具体地址]的手机屏幕店铺及店内相关设备出租给乙方使用，具体包括：店铺面积：[X]平方米；店内设备：[详细列出设备名称、数量、型号，如手机屏幕检测仪器3台、贴膜工具套装5套等]；附属设施：[如空调、货架、收银系统等]。二、租赁期限租赁期限自______年____月____日起至______年____月____日止，共计______个月。租赁期满前30日，乙方如需续租，应书面通知甲方，双方协商一致后可续签合同；未通知或协商不一致的，本合同到期自动终止。三、租金及支付方式租金标准：每月租金人民币[X]元（大写：____________________）。一、租赁标的甲方将位于[具体地址]的手机屏幕店铺及店内相关设备出租给乙方使用，具体包括：店铺面积：[X]平方米；店内设备：[详细列出设备名称、数量、型号，如手机屏幕检测仪器3台、贴膜工具套装5套等]；附属设施：[如空调、货架、收银系统等]。二、租赁期限租赁期限自______年____月____日起至______年____月____日止，共计______个月。租赁期满前30日，乙方如需续租，应书面通知甲方，双方协商一致后可续签合同；未通知或协商不一致的，本合同到期自动终止。三、租金及支付方式租金标准：每月租金人民币[X]元（大写：____________________）。', this, 5)
    this.getContractContent()
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})